app/Controllers/Lab.php

    public function index(): string
    {
        $data['title'] = 'Item Lab Single Test';
        $data['side'] = '4'; // Asumsi ini untuk navigasi atau styling

        // 1. Ambil semua data tindakan
        $tindakanList = $this->tindakan->findAll(); // Mengembalikan array of objects atau array of arrays
---
SELECT *
FROM `tb_tindakan`

    public function multiple(): string
    {
        $data['title'] = 'Item Lab Multiple Test';
        $data['side'] = '5';
        $data['paket'] = $this->paket->findAll();
---
SELECT *
FROM `tb_paket`

                if (empty($deskripsi)) {
                    $deskripsi = null;
                }
                $this->paket->save([
                    'nama_paket'    => $nama_paket,
                    'deskripsi_paket' => $deskripsi
                ]);
---
INSERT INTO `tb_paket` (`nama_paket`, `deskripsi_paket`) VALUES ('Makroskopik', NULL)