app/Controllers/Main.php

SELECT *
FROM `tb_users`
WHERE `id_perusahaan` != 2
---
    public function data_mcu(): string
    {
        $data = [
            'title' => 'Medical Check Up',
            'side' => '2',
            'subside' => '',
            'data_users' => $this->user->where('id_perusahaan !=', 2)->findAll()