app/Models/M_Nilai.php

SELECT `tb_nilai_normal`.`id_nilai_normal`, `tb_tindakan`.`nama_tindakan`, `tb_nilai_normal`.`kategori`, `tb_nilai_normal`.`nilai_min`, `tb_nilai_normal`.`nilai_max`
FROM `tb_nilai_normal`
JOIN `tb_tindakan` ON `tb_nilai_normal`.`id_tindakan` = `tb_tindakan`.`id_tindakan`
WHERE `tb_nilai_normal`.`id_tindakan` = 1
---
    public function getNilaiNormalByTindakan(int $id_tindakan): array
    {
        return $this->select('
                tb_nilai_normal.id_nilai_normal,
                tb_tindakan.nama_tindakan,
                tb_nilai_normal.kategori,
                tb_nilai_normal.nilai_min,
                tb_nilai_normal.nilai_max
            ')
            ->join('tb_tindakan', 'tb_nilai_normal.id_tindakan = tb_tindakan.id_tindakan')
            ->where('tb_nilai_normal.id_tindakan', $id_tindakan)
            ->findAll();