app/Models/Users.php

SELECT `tb_users`.*, `tb_lab`.*, `tb_lab`.`id` as `idlab`, `tb_perusahaan`.`nama_perusahaan`
FROM `tb_users`
JOIN `tb_lab` ON `tb_users`.`id` = `tb_lab`.`id_user`
LEFT JOIN `tb_perusahaan` ON `tb_users`.`id_perusahaan` = `tb_perusahaan`.`id`
WHERE `tb_users`.`id` = '483'
AND `tb_users`.`id` = '483'
 LIMIT 1
---
    public function getDetailLabById($id)
    {
        return $this->select('tb_users.*, tb_lab.*, tb_lab.id as idlab')
            ->join('tb_lab', 'tb_users.id = tb_lab.id_user')
            ->where('tb_users.id', $id)
            ->first();

SELECT `tb_users`.*, `tb_perusahaan`.`nama_perusahaan`
FROM `tb_users`
LEFT JOIN `tb_perusahaan` ON `tb_users`.`id_perusahaan` = `tb_perusahaan`.`id`
WHERE `tb_users`.`id` = '483'
 LIMIT 1
---
    public function getUserLabById($id)
    {
        return $this->select('tb_users.*, tb_perusahaan.nama_perusahaan')
            ->join('tb_perusahaan', 'tb_users.id_perusahaan = tb_perusahaan.id', 'left')
            ->where('tb_users.id', $id)
            ->first();

SELECT `jenis_kelamin`
FROM `tb_users`
WHERE `id` = '423'
 LIMIT 1
---
    public function getJkById($id)
    {
        return $this->select('jenis_kelamin')
            ->where('id', $id)
            ->first();